[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:24:37
         var i = 0;
         var foundDifferentDigit = false;
 
-        while(i < numberOfDigits && !foundDifferentDigit)
+        while(i < numberOfDigits && foundDifferentDigit)
         {
             var nextDigit = normalOrderDigits[i];
killedBy: PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers
