[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:13:12
 {
     public static bool IsPalindrome(uint number)
     {
-        if(number == 0)
+        if(number != 0)
         {
             return false;
killedBy: PalindromesTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:29:15
         var i = 0;
         var foundDifferentDigit = false;
 
-        while(i < numberOfDigits && !foundDifferentDigit)
+        while(i > numberOfDigits && !foundDifferentDigit)
         {
             var nextDigit = normalOrderDigits[i];
killedBy: PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromesTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:67:13
 
         do
         {
-            palindromes.Add(i);
+            ;
             i = GetLowestNextPalindrome(i);
         } while(i < maxNumber);
killedBy: PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:69:17
         {
             palindromes.Add(i);
             i = GetLowestNextPalindrome(i);
-        } while(i < maxNumber);
+        } while(i > maxNumber);
 
         palindromes.Add(i);
killedBy: PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Survived] Equality mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:69:17
         {
             palindromes.Add(i);
             i = GetLowestNextPalindrome(i);
-        } while(i < maxNumber);
+        } while(i <= maxNumber);
 
         palindromes.Add(i);

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:71:9
             i = GetLowestNextPalindrome(i);
         } while(i < maxNumber);
 
-        palindromes.Add(i);
+        ;
 
         var numberOfItems = palindromes.Count;
killedBy: PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Arithmetic mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:75:24
 
         var numberOfItems = palindromes.Count;
 
-        if(palindromes[numberOfItems - 1] > maxNumber)
+        if(palindromes[numberOfItems + 1] > maxNumber)
         {
             palindromes.RemoveAt(numberOfItems - 1);
killedBy: PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange
