[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:106:16
         var nthPalindrome = 1u;
         var order = 1;
 
-        while (order != position) 
+        while (order == position) 
         {
             order++;
killedBy: PalindromesTests.SinglePalindromesTests.CheckNthPalindromes; PalindromesTests.SinglePalindromesTests.CheckNthPalindromes; PalindromesTests.SinglePalindromesTests.CheckNthPalindromes

[Timeout] Statement mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:108:13
 
         while (order != position) 
         {
-            order++;
+            ;
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
GitHubRepos/PalindromicNumbers/Palindromes/SinglePalindromes.cs:108:13
 
         while (order != position) 
         {
-            order++;
+            order--;
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }
