[Killed] Block removal mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:17:5
     private readonly ILogger logger;
 
     public SinglePalindromes(ILogger logger)
-    {
-        this.logger = logger;
-    }
+    {}
 
     public bool IsPalindrome(uint number)
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.GetNthPalindromeShouldThrowException; PalindromesTests.SinglePalindromesTests.CheckNthPalindromes

[Timeout] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:32:9
         var numberOfDigits = normalOrderDigits.Count();
 
         var reverseOrderDigits = new short[normalOrderDigits.Length];
-        normalOrderDigits.CopyTo(reverseOrderDigits, 0);
+        ;
 
         reverseOrderDigits = reverseOrderDigits.Reverse().ToArray();

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:62:17
 
         while (!isNextPalindrome)
         {
-            if (i == uint.MaxValue)
+            if (i != uint.MaxValue)
             {
                 throw new System.OverflowException();
killedBy: PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromesTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:64:17
         {
             if (i == uint.MaxValue)
             {
-                throw new System.OverflowException();
+                ;
             }
 
killedBy: PalindromesTests.SinglePalindromesTests.GetLowestNextPalindromeMustThrowOverflowException

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:118:9
 
     public uint GetNthPalindrome(int position)
     {
-        logger.Information("Starting GetNthPalindrome for {position}", position);
+        ;
 
         if (position > 142946)
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.GetNthPalindromeShouldThrowException; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Negate expression
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:120:13
     {
         logger.Information("Starting GetNthPalindrome for {position}", position);
 
-        if (position > 142946)
+        if (!(position > 142946))
         {
             var message = $"The maximum palindrome that this program is able to calculate is 4294884924 at 142946th position";
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:120:13
     {
         logger.Information("Starting GetNthPalindrome for {position}", position);
 
-        if (position > 142946)
+        if (position < 142946)
         {
             var message = $"The maximum palindrome that this program is able to calculate is 4294884924 at 142946th position";
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages

[Killed] String mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:122:27
 
         if (position > 142946)
         {
-            var message = $"The maximum palindrome that this program is able to calculate is 4294884924 at 142946th position";
+            var message = $"";
             logger.Error("The maximum palindrome that this program is able to calculate is {nthPalindrome} at {order}th position", 4294884924, 142946);
             throw new ArgumentOutOfRangeException(message);
killedBy: PalindromesTests.SinglePalindromesTests.GetNthPalindromeShouldThrowException

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:123:13
         if (position > 142946)
         {
             var message = $"The maximum palindrome that this program is able to calculate is 4294884924 at 142946th position";
-            logger.Error("The maximum palindrome that this program is able to calculate is {nthPalindrome} at {order}th position", 4294884924, 142946);
+            ;
             throw new ArgumentOutOfRangeException(message);
         }
killedBy: PalindromesTests.SinglePalindromesTests.GetNthPalindromeShouldThrowException

[Timeout] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:124:13
         {
             var message = $"The maximum palindrome that this program is able to calculate is 4294884924 at 142946th position";
             logger.Error("The maximum palindrome that this program is able to calculate is {nthPalindrome} at {order}th position", 4294884924, 142946);
-            throw new ArgumentOutOfRangeException(message);
+            ;
         }
 

[Killed] Arithmetic mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:129:23
 
         var nthPalindrome = 1u;
         var order = 1;
-        var quarter = position / 4;
+        var quarter = position * 4;
         var quarterDisplayMessage = true;
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:130:37
         var nthPalindrome = 1u;
         var order = 1;
         var quarter = position / 4;
-        var quarterDisplayMessage = true;
+        var quarterDisplayMessage = false;
 
         var half = position / 2;
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Arithmetic mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:132:20
         var quarter = position / 4;
         var quarterDisplayMessage = true;
 
-        var half = position / 2;
+        var half = position * 2;
         var halfDisplayMessage = true;
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:133:34
         var quarterDisplayMessage = true;
 
         var half = position / 2;
-        var halfDisplayMessage = true;
+        var halfDisplayMessage = false;
 
         var thirdquarter = 3 * position / 4;
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Arithmetic mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:135:28
         var half = position / 2;
         var halfDisplayMessage = true;
 
-        var thirdquarter = 3 * position / 4;
+        var thirdquarter = 3 / position / 4;
         var thirdquarterDisplayMessage = true;
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Arithmetic mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:135:28
         var half = position / 2;
         var halfDisplayMessage = true;
 
-        var thirdquarter = 3 * position / 4;
+        var thirdquarter = 3 * position * 4;
         var thirdquarterDisplayMessage = true;
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:136:42
         var halfDisplayMessage = true;
 
         var thirdquarter = 3 * position / 4;
-        var thirdquarterDisplayMessage = true;
+        var thirdquarterDisplayMessage = false;
 
         while (order != position)
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Arithmetic mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:140:29
 
         while (order != position)
         {
-            var remainder = order % 10000;
+            var remainder = order * 10000;
             if (remainder == 1)
             {
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:141:17
         while (order != position)
         {
             var remainder = order % 10000;
-            if (remainder == 1)
+            if (remainder != 1)
             {
                 logger.Error("CurrentPalindrome: {currentPalindrome} - Maximum value for uint: {maxInt}", nthPalindrome, uint.MaxValue);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:143:17
             var remainder = order % 10000;
             if (remainder == 1)
             {
-                logger.Error("CurrentPalindrome: {currentPalindrome} - Maximum value for uint: {maxInt}", nthPalindrome, uint.MaxValue);
+                ;
                 logger.Information("{currentOrder}th Palindrome is: {currentPalindrome}", order, nthPalindrome);
             }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] String mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:143:30
             var remainder = order % 10000;
             if (remainder == 1)
             {
-                logger.Error("CurrentPalindrome: {currentPalindrome} - Maximum value for uint: {maxInt}", nthPalindrome, uint.MaxValue);
+                logger.Error("", nthPalindrome, uint.MaxValue);
                 logger.Information("{currentOrder}th Palindrome is: {currentPalindrome}", order, nthPalindrome);
             }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:144:17
             if (remainder == 1)
             {
                 logger.Error("CurrentPalindrome: {currentPalindrome} - Maximum value for uint: {maxInt}", nthPalindrome, uint.MaxValue);
-                logger.Information("{currentOrder}th Palindrome is: {currentPalindrome}", order, nthPalindrome);
+                ;
             }
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:147:66
                 logger.Information("{currentOrder}th Palindrome is: {currentPalindrome}", order, nthPalindrome);
             }
 
-            if (quarterDisplayMessage && order >= quarter - 1 && order <= quarter + 1)
+            if (quarterDisplayMessage && order >= quarter - 1 && order > quarter + 1)
             {
                 logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Logical mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:147:17
                 logger.Information("{currentOrder}th Palindrome is: {currentPalindrome}", order, nthPalindrome);
             }
 
-            if (quarterDisplayMessage && order >= quarter - 1 && order <= quarter + 1)
+            if (quarterDisplayMessage && order >= quarter - 1 || order <= quarter + 1)
             {
                 logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:149:17
 
             if (quarterDisplayMessage && order >= quarter - 1 && order <= quarter + 1)
             {
-                logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
+                ;
                 quarterDisplayMessage = false;
             }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:150:41
             if (quarterDisplayMessage && order >= quarter - 1 && order <= quarter + 1)
             {
                 logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
-                quarterDisplayMessage = false;
+                quarterDisplayMessage = true;
             }
             else if (halfDisplayMessage && order >= half - 1 && order <= half + 1)
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Logical mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:152:22
                 logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
                 quarterDisplayMessage = false;
             }
-            else if (halfDisplayMessage && order >= half - 1 && order <= half + 1)
+            else if (halfDisplayMessage && order >= half - 1 || order <= half + 1)
             {
                 logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:152:65
                 logger.Information("A quarter of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
                 quarterDisplayMessage = false;
             }
-            else if (halfDisplayMessage && order >= half - 1 && order <= half + 1)
+            else if (halfDisplayMessage && order >= half - 1 && order > half + 1)
             {
                 logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:154:17
             }
             else if (halfDisplayMessage && order >= half - 1 && order <= half + 1)
             {
-                logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
+                ;
                 halfDisplayMessage = false;
             }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:155:38
             else if (halfDisplayMessage && order >= half - 1 && order <= half + 1)
             {
                 logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
-                halfDisplayMessage = false;
+                halfDisplayMessage = true;
             }
             else if (thirdquarterDisplayMessage && order >= thirdquarter - 1 && order <= thirdquarter + 1)
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:157:52
                 logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
                 halfDisplayMessage = false;
             }
-            else if (thirdquarterDisplayMessage && order >= thirdquarter - 1 && order <= thirdquarter + 1)
+            else if (thirdquarterDisplayMessage && order > thirdquarter - 1 && order <= thirdquarter + 1)
             {
                 logger.Information("Three quarters of processing for {currentOrder} have been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Equality mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:157:52
                 logger.Information("Half of processing for {currentOrder} has been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
                 halfDisplayMessage = false;
             }
-            else if (thirdquarterDisplayMessage && order >= thirdquarter - 1 && order <= thirdquarter + 1)
+            else if (thirdquarterDisplayMessage && order < thirdquarter - 1 && order <= thirdquarter + 1)
             {
                 logger.Information("Three quarters of processing for {currentOrder} have been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:159:17
             }
             else if (thirdquarterDisplayMessage && order >= thirdquarter - 1 && order <= thirdquarter + 1)
             {
-                logger.Information("Three quarters of processing for {currentOrder} have been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
+                ;
                 thirdquarterDisplayMessage = false;
             }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] Boolean mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:160:46
             else if (thirdquarterDisplayMessage && order >= thirdquarter - 1 && order <= thirdquarter + 1)
             {
                 logger.Information("Three quarters of processing for {currentOrder} have been completed - Current palindrome: {palindrome}...", order, nthPalindrome);
-                thirdquarterDisplayMessage = false;
+                thirdquarterDisplayMessage = true;
             }
 
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Timeout] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:163:13
                 thirdquarterDisplayMessage = false;
             }
 
-            order++;
+            ;
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:163:13
                 thirdquarterDisplayMessage = false;
             }
 
-            order++;
+            order--;
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }

[Killed] Statement mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:167:9
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }
 
-        logger.Information("Finished GetNthPalindrome for {position} - Palindrome is: {palindrome}", position, nthPalindrome);
+        ;
         return nthPalindrome;
     }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2

[Killed] String mutation
GitHubRepos/Palindromes/Palindromes/SinglePalindromes.cs:167:28
             nthPalindrome = GetLowestNextPalindrome(nthPalindrome);
         }
 
-        logger.Information("Finished GetNthPalindrome for {position} - Palindrome is: {palindrome}", position, nthPalindrome);
+        logger.Information("", position, nthPalindrome);
         return nthPalindrome;
     }
killedBy: PalindromesTests.SinglePalindromesTests.CheckLogMessages; PalindromesTests.SinglePalindromesTests.CheckLogMessages2
