[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:17:9
         var numberOfDigits = normalOrderDigits.Count();
 
         short[] reverseOrderDigits = new short[normalOrderDigits.Length];
-        normalOrderDigits.CopyTo(reverseOrderDigits, 0);
+        ;
 
         reverseOrderDigits = reverseOrderDigits.Reverse().ToArray();
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Linq method mutation (Reverse() to AsEnumerable())
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:19:30
         short[] reverseOrderDigits = new short[normalOrderDigits.Length];
         normalOrderDigits.CopyTo(reverseOrderDigits, 0);
 
-        reverseOrderDigits = reverseOrderDigits.Reverse().ToArray();
+        reverseOrderDigits = reverseOrderDigits.AsEnumerable().ToArray();
 
         var i = 0;
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] Boolean mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:22:35
         reverseOrderDigits = reverseOrderDigits.Reverse().ToArray();
 
         var i = 0;
-        var foundDifferentDigit = false;
+        var foundDifferentDigit = true;
 
         while(i < numberOfDigits && !foundDifferentDigit)
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:24:15
         var i = 0;
         var foundDifferentDigit = false;
 
-        while(i < numberOfDigits && !foundDifferentDigit)
+        while(i <= numberOfDigits && !foundDifferentDigit)
         {
             var nextDigit = normalOrderDigits[i];
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Logical mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:24:15
         var i = 0;
         var foundDifferentDigit = false;
 
-        while(i < numberOfDigits && !foundDifferentDigit)
+        while(i < numberOfDigits || !foundDifferentDigit)
         {
             var nextDigit = normalOrderDigits[i];
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:29:16
             var nextDigit = normalOrderDigits[i];
             var reverseDigit = reverseOrderDigits[i];
 
-            if(nextDigit != reverseDigit)
+            if(nextDigit == reverseDigit)
             {
                 foundDifferentDigit = true;
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Boolean mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:31:39
 
             if(nextDigit != reverseDigit)
             {
-                foundDifferentDigit = true;
+                foundDifferentDigit = false;
             }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:34:13
                 foundDifferentDigit = true;
             }
 
-            i++;
+            i--;
         }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Timeout] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:34:13
                 foundDifferentDigit = true;
             }
 
-            i++;
+            ;
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:37:16
             i++;
         }
 
-        return !foundDifferentDigit;
+        return foundDifferentDigit;
     }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:46:15
         var remainder = number;
         uint currentDigit;
 
-        while(remainder > 0)
+        while(remainder < 0)
         {
             currentDigit = remainder % 10;
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] Negate expression
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:46:15
         var remainder = number;
         uint currentDigit;
 
-        while(remainder > 0)
+        while(!(remainder > 0))
         {
             currentDigit = remainder % 10;
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] Arithmetic mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:48:28
 
         while(remainder > 0)
         {
-            currentDigit = remainder % 10;
+            currentDigit = remainder * 10;
             remainder = remainder / 10;
             digits.Add((short)currentDigit);
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Arithmetic mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:49:25
         while(remainder > 0)
         {
             currentDigit = remainder % 10;
-            remainder = remainder / 10;
+            remainder = remainder * 10;
             digits.Add((short)currentDigit);
         }
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckValidPalindromeNumbers

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:50:13
         {
             currentDigit = remainder % 10;
             remainder = remainder / 10;
-            digits.Add((short)currentDigit);
+            ;
         }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers; PalindromicLibTests.SinglePalindromesTests.CheckInvalidPalindromeNumbers

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:53:9
             digits.Add((short)currentDigit);
         }
 
-        digits.Reverse();
+        ;
 
         return digits.ToArray();
killedBy: PalindromicLibTests.SinglePalindromesTests.GetDigitsShouldReturnAnArrayOfDigits
