[Killed] Boolean mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:42:32
 
     public static uint GetLowestNextPalindrome(uint number)
     {
-        var isNextPalindrome = false;
+        var isNextPalindrome = true;
         var i = number;
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:45:15
         var isNextPalindrome = false;
         var i = number;
 
-        while(!isNextPalindrome)
+        while(isNextPalindrome)
         {
             i++;
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome

[Killed] PostIncrementExpression to PostDecrementExpression mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:47:13
 
         while(!isNextPalindrome)
         {
-            i++;
+            i--;
             isNextPalindrome = IsPalindrome(i);
         }
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:47:13
 
         while(!isNextPalindrome)
         {
-            i++;
+            ;
             isNextPalindrome = IsPalindrome(i);
         }
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome; PalindromicLibTests.SinglePalindromesTests.CheckTheNextLowestPalindrome

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:60:15
 
         var i = 0u;
 
-        while(i < maxNumber)
+        while(i > maxNumber)
         {
             i = GetLowestNextPalindrome(i);
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Negate expression
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:60:15
 
         var i = 0u;
 
-        while(i < maxNumber)
+        while(!(i < maxNumber))
         {
             i = GetLowestNextPalindrome(i);
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:63:13
         while(i < maxNumber)
         {
             i = GetLowestNextPalindrome(i);
-            palindromes.Add(i);
+            ;
         }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Equality mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:68:12
 
         var numberOfItems = palindromes.Count;
 
-        if(palindromes[numberOfItems - 1] > maxNumber)
+        if(palindromes[numberOfItems - 1] >= maxNumber)
         {
             palindromes.RemoveAt(numberOfItems - 1);
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Negate expression
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:68:12
 
         var numberOfItems = palindromes.Count;
 
-        if(palindromes[numberOfItems - 1] > maxNumber)
+        if(!(palindromes[numberOfItems - 1] > maxNumber))
         {
             palindromes.RemoveAt(numberOfItems - 1);
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Statement mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:70:13
 
         if(palindromes[numberOfItems - 1] > maxNumber)
         {
-            palindromes.RemoveAt(numberOfItems - 1);
+            ;
         }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange

[Killed] Arithmetic mutation
GitHubRepos/PalindromicNumbers/PalindromicLib/SinglePalindromes.cs:70:34
 
         if(palindromes[numberOfItems - 1] > maxNumber)
         {
-            palindromes.RemoveAt(numberOfItems - 1);
+            palindromes.RemoveAt(numberOfItems + 1);
         }
 
killedBy: PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange; PalindromicLibTests.SinglePalindromesTests.CheckListOfPalindromesInARange
